[
    {
        "type": "quote",
        "value": "Non hai un talento? Scrivici, lo troveremo insieme!"
    },
    {
        "type": "quote",
        "value": "Stai impazzendo nella tua ricerca? Contattaci, siamo esperti in follia!"
    },
    {
        "type": "quote",
        "value": "Vuoi sviluppare un software ma non hai soldi? Non premermi più, ti prego!"
    },
    {
        "type": "quote",
        "value": "Hai premuto il pulsante, ora sei ufficialmente un nostro cliente!"
    },
    {
        "type": "quote",
        "value": "Non sai cosa fare? Noi nemmeno, ma possiamo pensarci insieme!"
    },
    {
        "type": "quote",
        "value": "Hai bisogno di un'idea geniale? Premimi ancora, forse funziona!"
    },
    {
        "type": "quote",
        "value": "Sei bloccato? Noi siamo qui per complicarti la vita... o semplificarla!"
    },
    {
        "type": "quote",
        "value": "Hai premuto il pulsante, ora sei parte del club dei curiosi!"
    },
    {
        "type": "quote",
        "value": "Non premermi più, sto iniziando a sentirmi importante!"
    },
    {
        "type": "quote",
        "value": "Hai un problema? Noi abbiamo un pulsante, ed è già qualcosa!"
    },
    {
        "type": "quote",
        "value": "Cerchiamo talenti! Se hai un talento nascosto, premi ancora!"
    },
    {
        "type": "quote",
        "value": "Lavora con noi! Abbiamo pulsanti da premere e sogni da realizzare! 😊"
    },
    {
        "type": "quote",
        "value": "Se costi poco, entra nel nostro club! 😄"
    },
    {
        "type": "quote",
        "value": "Hai mai pensato di unirti a un team di pulsanti? Noi sì!"
    },
    {
        "type": "quote",
        "value": "Premi qui per un sorriso gratuito! 😁"
    },
    {
        "type": "quote",
        "value": "Sei un talento incompreso? Noi ti capiamo, premi ancora!"
    },
    {
        "type": "quote",
        "value": "Lavora con noi: il pulsante è solo l'inizio! 🚀"
    },
    {
        "type": "quote",
        "value": "Sei economico e brillante? Benvenuto nel nostro club esclusivo! 🎉"
    },
    {
        "type": "quote",
        "value": "Premi qui per unirti alla squadra più sorridente del web! 😎"
    },
    {
        "type": "quote",
        "value": "Hai talento? Noi abbiamo pulsanti! Facciamo squadra! 🤝"
    }
]